photography.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Photography</title>
<meta name="generator" content="Org mode" />
<meta name="keywords" content="Photography" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Photography</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb5f076e">Composition</a>
<ul>
<li><a href="#orgc562910">Horizontal horizons</a></li>
<li><a href="#org839511d">Rule of thirds: Give subjects room to MOVE into or SEE into (nose room).</a></li>
<li><a href="#org88244f2">Framing</a></li>
<li><a href="#org71c854b">Check your backgrounds!</a></li>
<li><a href="#org0c59fdc">Fill the Frame</a></li>
<li><a href="#orga9e0992">Leading lines</a></li>
<li><a href="#org17a8fa9">Anything but eye-level</a></li>
<li><a href="#orgb3c4f0d">Look for details</a></li>
<li><a href="#org150df56">Take vertical photos</a></li>
<li><a href="#org98406dd">Break these rules</a></li>
</ul>
</li>
<li><a href="#org5d992ae">Exposure</a>
<ul>
<li><a href="#org6cb3897">Most time auto is good.</a></li>
<li><a href="#orge71c505">Adjust manually when in snow, bright windows. No need to play with different metering mode.</a></li>
<li><a href="#org19a42f3">Use histogram to check exposure. Sometimes the small screen is hard to see.</a></li>
<li><a href="#org812de70">Spot meter is for studio when they have a gray card.</a></li>
</ul>
</li>
<li><a href="#orgfbc65d8">Modes</a>
<ul>
<li><a href="#org71a28d8">Rule of thumb</a>
<ul>
<li><a href="#org466d4cd">If you want to explicitly control the shutter speed, then S mode.</a></li>
<li><a href="#orgf75fb90">When the ideal shutter speed (e.g. 1/100) is fast enough, then A mode.</a></li>
</ul>
</li>
<li><a href="#orge2884bf">Aperture mode + auto ISO:</a></li>
<li><a href="#org35b9bbf">Shutter speed mode + auto ISO:</a></li>
<li><a href="#orge241e38">Manual mode: often used in studio</a></li>
<li><a href="#org96f5179">Program mode: different combo between A and S.</a></li>
</ul>
</li>
<li><a href="#orgbbf8347">Lighting</a>
<ul>
<li><a href="#org73704ca">Close to (1 hour before and after) sunrise or sunset is good.</a></li>
<li><a href="#org36f9c93">Lighting in cloudy day is good. (Although the sky does not look good.)</a></li>
<li><a href="#org06b079f">Find/create a shade in harsh sunlight.</a></li>
<li><a href="#org54cc0ad">Fill-Flash: use flashlight in harsh sunlight to get rid of the shadow.</a></li>
<li><a href="#orgb95bf76">Direct flashlight at night is too fake. Use some indirect light.</a></li>
</ul>
</li>
<li><a href="#orgd6c6046">Focus</a></li>
</ul>
</div>
</div>
<p>
These are my notes while watch this <a href="https://www.youtube.com/watch?v=LxO-6rlihSg&amp;list=PLT1Q-TlUqiDYIRVZqnSrl5PQOu2W282EC&amp;index=8&amp;t=128s">Youtube video</a>.
</p>

<div id="outline-container-orgb5f076e" class="outline-2">
<h2 id="orgb5f076e">Composition</h2>
<div class="outline-text-2" id="text-orgb5f076e">
</div>
<div id="outline-container-orgc562910" class="outline-3">
<h3 id="orgc562910">Horizontal horizons</h3>
</div>
<div id="outline-container-org839511d" class="outline-3">
<h3 id="org839511d">Rule of thirds: Give subjects room to MOVE into or SEE into (nose room).</h3>
<div class="outline-text-3" id="text-org839511d">
<ul class="org-ul">
<li>almost always better than just put the subject in the middle</li>
<li>An exception is lake, where the symmetry is key.</li>
</ul>
</div>
</div>
<div id="outline-container-org88244f2" class="outline-3">
<h3 id="org88244f2">Framing</h3>
<div class="outline-text-3" id="text-org88244f2">
<ul class="org-ul">
<li>Have some stuff close but not in focus to show the depth.</li>
<li>Otherwise, the scene far away looks flat.</li>
</ul>
</div>
</div>
<div id="outline-container-org71c854b" class="outline-3">
<h3 id="org71c854b">Check your backgrounds!</h3>
<div class="outline-text-3" id="text-org71c854b">
<ul class="org-ul">
<li>Change your view point to find a better background to make subject standout (contrast in terms of color).</li>
<li>The ant with a green leaf as background to standout.</li>
</ul>
</div>
</div>
<div id="outline-container-org0c59fdc" class="outline-3">
<h3 id="org0c59fdc">Fill the Frame</h3>
<div class="outline-text-3" id="text-org0c59fdc">
<ul class="org-ul">
<li>No need to fit everything in.</li>
</ul>
</div>
</div>
<div id="outline-container-orga9e0992" class="outline-3">
<h3 id="orga9e0992">Leading lines</h3>
<div class="outline-text-3" id="text-orga9e0992">
<ul class="org-ul">
<li>even better if the line start at the corner of the image</li>
</ul>
</div>
</div>
<div id="outline-container-org17a8fa9" class="outline-3">
<h3 id="org17a8fa9">Anything but eye-level</h3>
<div class="outline-text-3" id="text-org17a8fa9">
<ul class="org-ul">
<li>at least as low as you subject.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb3c4f0d" class="outline-3">
<h3 id="orgb3c4f0d">Look for details</h3>
</div>
<div id="outline-container-org150df56" class="outline-3">
<h3 id="org150df56">Take vertical photos</h3>
</div>
<div id="outline-container-org98406dd" class="outline-3">
<h3 id="org98406dd">Break these rules</h3>
</div>
</div>

<div id="outline-container-org5d992ae" class="outline-2">
<h2 id="org5d992ae">Exposure</h2>
<div class="outline-text-2" id="text-org5d992ae">
</div>
<div id="outline-container-org6cb3897" class="outline-3">
<h3 id="org6cb3897">Most time auto is good.</h3>
</div>
<div id="outline-container-orge71c505" class="outline-3">
<h3 id="orge71c505">Adjust manually when in snow, bright windows. No need to play with different metering mode.</h3>
</div>
<div id="outline-container-org19a42f3" class="outline-3">
<h3 id="org19a42f3">Use histogram to check exposure. Sometimes the small screen is hard to see.</h3>
</div>
<div id="outline-container-org812de70" class="outline-3">
<h3 id="org812de70">Spot meter is for studio when they have a gray card.</h3>
</div>
</div>

<div id="outline-container-orgfbc65d8" class="outline-2">
<h2 id="orgfbc65d8">Modes</h2>
<div class="outline-text-2" id="text-orgfbc65d8">
</div>
<div id="outline-container-org71a28d8" class="outline-3">
<h3 id="org71a28d8">Rule of thumb</h3>
<div class="outline-text-3" id="text-org71a28d8">
</div>
<div id="outline-container-org466d4cd" class="outline-4">
<h4 id="org466d4cd">If you want to explicitly control the shutter speed, then S mode.</h4>
<div class="outline-text-4" id="text-org466d4cd">
<ul class="org-ul">
<li>Use when the subject is moving (faster shutter speed),</li>
<li>Or then you want a slower than normal shutter speed, e.g. water fall, motion blur.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf75fb90" class="outline-4">
<h4 id="orgf75fb90">When the ideal shutter speed (e.g. 1/100) is fast enough, then A mode.</h4>
<div class="outline-text-4" id="text-orgf75fb90">
<ul class="org-ul">
<li>Stationary scene or portrait.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge2884bf" class="outline-3">
<h3 id="orge2884bf">Aperture mode + auto ISO:</h3>
<div class="outline-text-3" id="text-orge2884bf">
<ul class="org-ul">
<li>Compute the slowest shutter speed based on focal length to be hand-shake-proof.</li>
<li>Ideal state: the hand-shake-proof shutter speed (e.g. 1/100s), the lowest ISO (e.g. 160).</li>
<li>If environment is darker, keep ideal shutter speed, use higher ISO.
If highest ISO riches, even slower shutter speed.</li>
<li>If environment is brighter, keep the lowest ISO, faster shutter speed.</li>
</ul>
</div>
</div>

<div id="outline-container-org35b9bbf" class="outline-3">
<h3 id="org35b9bbf">Shutter speed mode + auto ISO:</h3>
<div class="outline-text-3" id="text-org35b9bbf">
<ul class="org-ul">
<li>Largest f and smallest ISO is the darkest it can get.</li>
<li>It will first reduce f, then increase ISO.</li>
<li>The logic of this mode is simpler than Aperture mode because you control the shutter speed and there is no hand-shake-proof ideal shutter speed.</li>
</ul>
</div>
</div>

<div id="outline-container-orge241e38" class="outline-3">
<h3 id="orge241e38">Manual mode: often used in studio</h3>
<div class="outline-text-3" id="text-orge241e38">
<ul class="org-ul">
<li>When the environment does not change, so you do not want the camera to auto choose A, S, ISO every time.</li>
<li>Also, when you have some way to measure you are having good exposure.</li>
</ul>
</div>
</div>

<div id="outline-container-org96f5179" class="outline-3">
<h3 id="org96f5179">Program mode: different combo between A and S.</h3>
<div class="outline-text-3" id="text-org96f5179">
<ul class="org-ul">
<li>You have to adjust the combo every time. It is better than auto mode, but not as good as S or A mode where you have direct control.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbbf8347" class="outline-2">
<h2 id="orgbbf8347">Lighting</h2>
<div class="outline-text-2" id="text-orgbbf8347">
</div>
<div id="outline-container-org73704ca" class="outline-3">
<h3 id="org73704ca">Close to (1 hour before and after) sunrise or sunset is good.</h3>
</div>
<div id="outline-container-org36f9c93" class="outline-3">
<h3 id="org36f9c93">Lighting in cloudy day is good. (Although the sky does not look good.)</h3>
</div>
<div id="outline-container-org06b079f" class="outline-3">
<h3 id="org06b079f">Find/create a shade in harsh sunlight.</h3>
</div>
<div id="outline-container-org54cc0ad" class="outline-3">
<h3 id="org54cc0ad">Fill-Flash: use flashlight in harsh sunlight to get rid of the shadow.</h3>
</div>
<div id="outline-container-orgb95bf76" class="outline-3">
<h3 id="orgb95bf76">Direct flashlight at night is too fake. Use some indirect light.</h3>
</div>
</div>

<div id="outline-container-orgd6c6046" class="outline-2">
<h2 id="orgd6c6046">Focus</h2>
<div class="outline-text-2" id="text-orgd6c6046">
<p>
When you set a focus point/distance, if the depth that is in focus is d, the focus point is at 1/3 of d. This is why you focus on eyes.
</p>

<script src="https://utteranc.es/client.js"
        repo="sychen52/sychen52.github.io"
        issue-term="pathname"
        theme="github-dark"
        crossorigin="anonymous"
        async>
</script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-12-24 Fri 00:00</p>
<p class="validation"></p>
</div>
</body>
</html>
